apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_interrupt.h
/****************************************************************************
 * arch/risc-v/src/esp32c3/hardware/esp32c3_system.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_RISCV_SRC_ESP32C3_HARDWARE_ESP32C3_INTERRUPT_H
#define __ARCH_RISCV_SRC_ESP32C3_HARDWARE_ESP32C3_INTERRUPT_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/esp32c3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define INTERRUPT_MAC_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x000)

/* INTERRUPT_MAC_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_MAC_INTR_MAP  0x0000001f
#define INTERRUPT_MAC_INTR_MAP_M  ((INTERRUPT_MAC_INTR_MAP_V) << (INTERRUPT_MAC_INTR_MAP_S))
#define INTERRUPT_MAC_INTR_MAP_V  0x1f
#define INTERRUPT_MAC_INTR_MAP_S  0

#define INTERRUPT_MAC_NMI_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x004)

/* INTERRUPT_MAC_NMI_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_MAC_NMI_MAP  0x0000001f
#define INTERRUPT_MAC_NMI_MAP_M  ((INTERRUPT_MAC_NMI_MAP_V) << (INTERRUPT_MAC_NMI_MAP_S))
#define INTERRUPT_MAC_NMI_MAP_V  0x1f
#define INTERRUPT_MAC_NMI_MAP_S  0

#define INTERRUPT_PWR_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x008)

/* INTERRUPT_PWR_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_PWR_INTR_MAP  0x0000001f
#define INTERRUPT_PWR_INTR_MAP_M  ((INTERRUPT_PWR_INTR_MAP_V) << (INTERRUPT_PWR_INTR_MAP_S))
#define INTERRUPT_PWR_INTR_MAP_V  0x1f
#define INTERRUPT_PWR_INTR_MAP_S  0

#define INTERRUPT_BB_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x00c)

/* INTERRUPT_BB_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_BB_INT_MAP  0x0000001f
#define INTERRUPT_BB_INT_MAP_M  ((INTERRUPT_BB_INT_MAP_V) << (INTERRUPT_BB_INT_MAP_S))
#define INTERRUPT_BB_INT_MAP_V  0x1f
#define INTERRUPT_BB_INT_MAP_S  0

#define INTERRUPT_BT_MAC_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x010)

/* INTERRUPT_BT_MAC_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_BT_MAC_INT_MAP  0x0000001f
#define INTERRUPT_BT_MAC_INT_MAP_M  ((INTERRUPT_BT_MAC_INT_MAP_V) << (INTERRUPT_BT_MAC_INT_MAP_S))
#define INTERRUPT_BT_MAC_INT_MAP_V  0x1f
#define INTERRUPT_BT_MAC_INT_MAP_S  0

#define INTERRUPT_BT_BB_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x014)

/* INTERRUPT_BT_BB_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_BT_BB_INT_MAP  0x0000001f
#define INTERRUPT_BT_BB_INT_MAP_M  ((INTERRUPT_BT_BB_INT_MAP_V) << (INTERRUPT_BT_BB_INT_MAP_S))
#define INTERRUPT_BT_BB_INT_MAP_V  0x1f
#define INTERRUPT_BT_BB_INT_MAP_S  0

#define INTERRUPT_BT_BB_NMI_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x018)

/* INTERRUPT_BT_BB_NMI_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_BT_BB_NMI_MAP  0x0000001f
#define INTERRUPT_BT_BB_NMI_MAP_M  ((INTERRUPT_BT_BB_NMI_MAP_V) << (INTERRUPT_BT_BB_NMI_MAP_S))
#define INTERRUPT_BT_BB_NMI_MAP_V  0x1f
#define INTERRUPT_BT_BB_NMI_MAP_S  0

#define INTERRUPT_RWBT_IRQ_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x01c)

/* INTERRUPT_RWBT_IRQ_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_RWBT_IRQ_MAP  0x0000001f
#define INTERRUPT_RWBT_IRQ_MAP_M  ((INTERRUPT_RWBT_IRQ_MAP_V) << (INTERRUPT_RWBT_IRQ_MAP_S))
#define INTERRUPT_RWBT_IRQ_MAP_V  0x1f
#define INTERRUPT_RWBT_IRQ_MAP_S  0

#define INTERRUPT_RWBLE_IRQ_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x020)

/* INTERRUPT_RWBLE_IRQ_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_RWBLE_IRQ_MAP  0x0000001f
#define INTERRUPT_RWBLE_IRQ_MAP_M  ((INTERRUPT_RWBLE_IRQ_MAP_V) << (INTERRUPT_RWBLE_IRQ_MAP_S))
#define INTERRUPT_RWBLE_IRQ_MAP_V  0x1f
#define INTERRUPT_RWBLE_IRQ_MAP_S  0

#define INTERRUPT_RWBT_NMI_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x024)

/* INTERRUPT_RWBT_NMI_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_RWBT_NMI_MAP  0x0000001f
#define INTERRUPT_RWBT_NMI_MAP_M  ((INTERRUPT_RWBT_NMI_MAP_V) << (INTERRUPT_RWBT_NMI_MAP_S))
#define INTERRUPT_RWBT_NMI_MAP_V  0x1f
#define INTERRUPT_RWBT_NMI_MAP_S  0

#define INTERRUPT_RWBLE_NMI_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x028)

/* INTERRUPT_RWBLE_NMI_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_RWBLE_NMI_MAP  0x0000001f
#define INTERRUPT_RWBLE_NMI_MAP_M  ((INTERRUPT_RWBLE_NMI_MAP_V) << (INTERRUPT_RWBLE_NMI_MAP_S))
#define INTERRUPT_RWBLE_NMI_MAP_V  0x1f
#define INTERRUPT_RWBLE_NMI_MAP_S  0

#define INTERRUPT_I2C_MST_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x02c)

/* INTERRUPT_I2C_MST_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_I2C_MST_INT_MAP  0x0000001f
#define INTERRUPT_I2C_MST_INT_MAP_M  ((INTERRUPT_I2C_MST_INT_MAP_V) << (INTERRUPT_I2C_MST_INT_MAP_S))
#define INTERRUPT_I2C_MST_INT_MAP_V  0x1f
#define INTERRUPT_I2C_MST_INT_MAP_S  0

#define INTERRUPT_SLC0_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x030)

/* INTERRUPT_SLC0_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SLC0_INTR_MAP  0x0000001f
#define INTERRUPT_SLC0_INTR_MAP_M  ((INTERRUPT_SLC0_INTR_MAP_V) << (INTERRUPT_SLC0_INTR_MAP_S))
#define INTERRUPT_SLC0_INTR_MAP_V  0x1f
#define INTERRUPT_SLC0_INTR_MAP_S  0

#define INTERRUPT_SLC1_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x034)

/* INTERRUPT_SLC1_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SLC1_INTR_MAP  0x0000001f
#define INTERRUPT_SLC1_INTR_MAP_M  ((INTERRUPT_SLC1_INTR_MAP_V) << (INTERRUPT_SLC1_INTR_MAP_S))
#define INTERRUPT_SLC1_INTR_MAP_V  0x1f
#define INTERRUPT_SLC1_INTR_MAP_S  0

