apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_interrupt.h
#define INTERRUPT_APB_CTRL_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x038)

/* INTERRUPT_APB_CTRL_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_APB_CTRL_INTR_MAP  0x0000001f
#define INTERRUPT_APB_CTRL_INTR_MAP_M  ((INTERRUPT_APB_CTRL_INTR_MAP_V) << (INTERRUPT_APB_CTRL_INTR_MAP_S))
#define INTERRUPT_APB_CTRL_INTR_MAP_V  0x1f
#define INTERRUPT_APB_CTRL_INTR_MAP_S  0

#define INTERRUPT_UHCI0_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x03c)

/* INTERRUPT_UHCI0_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_UHCI0_INTR_MAP  0x0000001f
#define INTERRUPT_UHCI0_INTR_MAP_M  ((INTERRUPT_UHCI0_INTR_MAP_V) << (INTERRUPT_UHCI0_INTR_MAP_S))
#define INTERRUPT_UHCI0_INTR_MAP_V  0x1f
#define INTERRUPT_UHCI0_INTR_MAP_S  0

#define INTERRUPT_GPIO_INTERRUPT_PRO_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x040)

/* INTERRUPT_GPIO_INTERRUPT_PRO_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_GPIO_INTERRUPT_PRO_MAP  0x0000001f
#define INTERRUPT_GPIO_INTERRUPT_PRO_MAP_M  ((INTERRUPT_GPIO_INTERRUPT_PRO_MAP_V) << (INTERRUPT_GPIO_INTERRUPT_PRO_MAP_S))
#define INTERRUPT_GPIO_INTERRUPT_PRO_MAP_V  0x1f
#define INTERRUPT_GPIO_INTERRUPT_PRO_MAP_S  0

#define INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x044)

/* INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP : R/W [4:0] 5'd0 ; */

#define INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP  0x0000001f
#define INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP_M  ((INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP_V) << (INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP_S))
#define INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP_V  0x1f
#define INTERRUPT_GPIO_INTERRUPT_PRO_NMI_MAP_S  0

#define INTERRUPT_SPI_INTR_1_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x048)

/* INTERRUPT_SPI_INTR_1_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SPI_INTR_1_MAP  0x0000001f
#define INTERRUPT_SPI_INTR_1_MAP_M  ((INTERRUPT_SPI_INTR_1_MAP_V) << (INTERRUPT_SPI_INTR_1_MAP_S))
#define INTERRUPT_SPI_INTR_1_MAP_V  0x1f
#define INTERRUPT_SPI_INTR_1_MAP_S  0

#define INTERRUPT_SPI_INTR_2_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x04c)

/* INTERRUPT_SPI_INTR_2_MAP : R/W [4:0] : 5'd0 ; */
#define INTERRUPT_SPI_INTR_2_MAP  0x0000001f
#define INTERRUPT_SPI_INTR_2_MAP_M  ((INTERRUPT_SPI_INTR_2_MAP_V) << (INTERRUPT_SPI_INTR_2_MAP_S))
#define INTERRUPT_SPI_INTR_2_MAP_V  0x1f
#define INTERRUPT_SPI_INTR_2_MAP_S  0

#define INTERRUPT_I2S1_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x050)

/* INTERRUPT_I2S1_INT_MAP : R/W [4:0] : 5'd0 ; */
#define INTERRUPT_I2S1_INT_MAP  0x0000001f
#define INTERRUPT_I2S1_INT_MAP_M  ((INTERRUPT_I2S1_INT_MAP_V) << (INTERRUPT_I2S1_INT_MAP_S))
#define INTERRUPT_I2S1_INT_MAP_V  0x1f
#define INTERRUPT_I2S1_INT_MAP_S  0

#define INTERRUPT_UART_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x054)

/* INTERRUPT_UART_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_UART_INTR_MAP  0x0000001f
#define INTERRUPT_UART_INTR_MAP_M  ((INTERRUPT_UART_INTR_MAP_V) << (INTERRUPT_UART_INTR_MAP_S))
#define INTERRUPT_UART_INTR_MAP_V  0x1f
#define INTERRUPT_UART_INTR_MAP_S  0

#define INTERRUPT_UART1_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x058)

/* INTERRUPT_UART1_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_UART1_INTR_MAP  0x0000001f
#define INTERRUPT_UART1_INTR_MAP_M  ((INTERRUPT_UART1_INTR_MAP_V) << (INTERRUPT_UART1_INTR_MAP_S))
#define INTERRUPT_UART1_INTR_MAP_V  0x1f
#define INTERRUPT_UART1_INTR_MAP_S  0

#define INTERRUPT_LEDC_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x05c)

/* INTERRUPT_LEDC_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_LEDC_INT_MAP  0x0000001f
#define INTERRUPT_LEDC_INT_MAP_M  ((INTERRUPT_LEDC_INT_MAP_V) << (INTERRUPT_LEDC_INT_MAP_S))
#define INTERRUPT_LEDC_INT_MAP_V  0x1f
#define INTERRUPT_LEDC_INT_MAP_S  0

#define INTERRUPT_EFUSE_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x060)

/* INTERRUPT_EFUSE_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_EFUSE_INT_MAP  0x0000001f
#define INTERRUPT_EFUSE_INT_MAP_M  ((INTERRUPT_EFUSE_INT_MAP_V) << (INTERRUPT_EFUSE_INT_MAP_S))
#define INTERRUPT_EFUSE_INT_MAP_V  0x1f
#define INTERRUPT_EFUSE_INT_MAP_S  0

#define INTERRUPT_CAN_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x064)

/* INTERRUPT_CAN_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CAN_INT_MAP  0x0000001f
#define INTERRUPT_CAN_INT_MAP_M  ((INTERRUPT_CAN_INT_MAP_V) << (INTERRUPT_CAN_INT_MAP_S))
#define INTERRUPT_CAN_INT_MAP_V  0x1f
#define INTERRUPT_CAN_INT_MAP_S  0

#define INTERRUPT_USB_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x068)

/* INTERRUPT_USB_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_USB_INTR_MAP  0x0000001f
#define INTERRUPT_USB_INTR_MAP_M  ((INTERRUPT_USB_INTR_MAP_V) << (INTERRUPT_USB_INTR_MAP_S))
#define INTERRUPT_USB_INTR_MAP_V  0x1f
#define INTERRUPT_USB_INTR_MAP_S  0

#define INTERRUPT_RTC_CORE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x06c)

/* INTERRUPT_RTC_CORE_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_RTC_CORE_INTR_MAP  0x0000001f
#define INTERRUPT_RTC_CORE_INTR_MAP_M  ((INTERRUPT_RTC_CORE_INTR_MAP_V) << (INTERRUPT_RTC_CORE_INTR_MAP_S))
#define INTERRUPT_RTC_CORE_INTR_MAP_V  0x1f
#define INTERRUPT_RTC_CORE_INTR_MAP_S  0

#define INTERRUPT_RMT_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x070)

/* INTERRUPT_RMT_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_RMT_INTR_MAP  0x0000001f
#define INTERRUPT_RMT_INTR_MAP_M  ((INTERRUPT_RMT_INTR_MAP_V) << (INTERRUPT_RMT_INTR_MAP_S))
#define INTERRUPT_RMT_INTR_MAP_V  0x1f
#define INTERRUPT_RMT_INTR_MAP_S  0

#define INTERRUPT_I2C_EXT0_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x074)

/* INTERRUPT_I2C_EXT0_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_I2C_EXT0_INTR_MAP  0x0000001f
#define INTERRUPT_I2C_EXT0_INTR_MAP_M  ((INTERRUPT_I2C_EXT0_INTR_MAP_V) << (INTERRUPT_I2C_EXT0_INTR_MAP_S))
#define INTERRUPT_I2C_EXT0_INTR_MAP_V  0x1f
#define INTERRUPT_I2C_EXT0_INTR_MAP_S  0

#define INTERRUPT_TIMER_INT1_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x078)

/* INTERRUPT_TIMER_INT1_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_TIMER_INT1_MAP  0x0000001f
#define INTERRUPT_TIMER_INT1_MAP_M  ((INTERRUPT_TIMER_INT1_MAP_V) << (INTERRUPT_TIMER_INT1_MAP_S))
#define INTERRUPT_TIMER_INT1_MAP_V  0x1f
#define INTERRUPT_TIMER_INT1_MAP_S  0

