apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_interrupt.h
#define INTERRUPT_TIMER_INT2_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x07c)

/* INTERRUPT_TIMER_INT2_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_TIMER_INT2_MAP  0x0000001f
#define INTERRUPT_TIMER_INT2_MAP_M  ((INTERRUPT_TIMER_INT2_MAP_V) << (INTERRUPT_TIMER_INT2_MAP_S))
#define INTERRUPT_TIMER_INT2_MAP_V  0x1f
#define INTERRUPT_TIMER_INT2_MAP_S  0

#define INTERRUPT_TG_T0_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x080)

/* INTERRUPT_TG_T0_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_TG_T0_INT_MAP  0x0000001f
#define INTERRUPT_TG_T0_INT_MAP_M  ((INTERRUPT_TG_T0_INT_MAP_V) << (INTERRUPT_TG_T0_INT_MAP_S))
#define INTERRUPT_TG_T0_INT_MAP_V  0x1f
#define INTERRUPT_TG_T0_INT_MAP_S  0

#define INTERRUPT_TG_WDT_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x084)

/* INTERRUPT_TG_WDT_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_TG_WDT_INT_MAP  0x0000001f
#define INTERRUPT_TG_WDT_INT_MAP_M  ((INTERRUPT_TG_WDT_INT_MAP_V) << (INTERRUPT_TG_WDT_INT_MAP_S))
#define INTERRUPT_TG_WDT_INT_MAP_V  0x1f
#define INTERRUPT_TG_WDT_INT_MAP_S  0

#define INTERRUPT_TG1_T0_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x088)

/* INTERRUPT_TG1_T0_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_TG1_T0_INT_MAP  0x0000001f
#define INTERRUPT_TG1_T0_INT_MAP_M  ((INTERRUPT_TG1_T0_INT_MAP_V) << (INTERRUPT_TG1_T0_INT_MAP_S))
#define INTERRUPT_TG1_T0_INT_MAP_V  0x1f
#define INTERRUPT_TG1_T0_INT_MAP_S  0

#define INTERRUPT_TG1_WDT_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x08c)

/* INTERRUPT_TG1_WDT_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_TG1_WDT_INT_MAP  0x0000001f
#define INTERRUPT_TG1_WDT_INT_MAP_M  ((INTERRUPT_TG1_WDT_INT_MAP_V) << (INTERRUPT_TG1_WDT_INT_MAP_S))
#define INTERRUPT_TG1_WDT_INT_MAP_V  0x1f
#define INTERRUPT_TG1_WDT_INT_MAP_S  0

#define INTERRUPT_CACHE_IA_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x090)

/* INTERRUPT_CACHE_IA_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CACHE_IA_INT_MAP  0x0000001f
#define INTERRUPT_CACHE_IA_INT_MAP_M  ((INTERRUPT_CACHE_IA_INT_MAP_V) << (INTERRUPT_CACHE_IA_INT_MAP_S))
#define INTERRUPT_CACHE_IA_INT_MAP_V  0x1f
#define INTERRUPT_CACHE_IA_INT_MAP_S  0

#define INTERRUPT_SYSTIMER_TARGET0_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x094)

/* INTERRUPT_SYSTIMER_TARGET0_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SYSTIMER_TARGET0_INT_MAP  0x0000001f
#define INTERRUPT_SYSTIMER_TARGET0_INT_MAP_M  ((INTERRUPT_SYSTIMER_TARGET0_INT_MAP_V) << (INTERRUPT_SYSTIMER_TARGET0_INT_MAP_S))
#define INTERRUPT_SYSTIMER_TARGET0_INT_MAP_V  0x1f
#define INTERRUPT_SYSTIMER_TARGET0_INT_MAP_S  0

#define INTERRUPT_SYSTIMER_TARGET1_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x098)

/* INTERRUPT_SYSTIMER_TARGET1_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SYSTIMER_TARGET1_INT_MAP  0x0000001f
#define INTERRUPT_SYSTIMER_TARGET1_INT_MAP_M  ((INTERRUPT_SYSTIMER_TARGET1_INT_MAP_V) << (INTERRUPT_SYSTIMER_TARGET1_INT_MAP_S))
#define INTERRUPT_SYSTIMER_TARGET1_INT_MAP_V  0x1f
#define INTERRUPT_SYSTIMER_TARGET1_INT_MAP_S  0

#define INTERRUPT_SYSTIMER_TARGET2_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x09c)

/* INTERRUPT_SYSTIMER_TARGET2_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SYSTIMER_TARGET2_INT_MAP  0x0000001f
#define INTERRUPT_SYSTIMER_TARGET2_INT_MAP_M  ((INTERRUPT_SYSTIMER_TARGET2_INT_MAP_V) << (INTERRUPT_SYSTIMER_TARGET2_INT_MAP_S))
#define INTERRUPT_SYSTIMER_TARGET2_INT_MAP_V  0x1f
#define INTERRUPT_SYSTIMER_TARGET2_INT_MAP_S  0

#define INTERRUPT_SPI_MEM_REJECT_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0a0)

/* INTERRUPT_SPI_MEM_REJECT_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SPI_MEM_REJECT_INTR_MAP  0x0000001f
#define INTERRUPT_SPI_MEM_REJECT_INTR_MAP_M  ((INTERRUPT_SPI_MEM_REJECT_INTR_MAP_V) << (INTERRUPT_SPI_MEM_REJECT_INTR_MAP_S))
#define INTERRUPT_SPI_MEM_REJECT_INTR_MAP_V  0x1f
#define INTERRUPT_SPI_MEM_REJECT_INTR_MAP_S  0

#define INTERRUPT_ICACHE_PRELOAD_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0a4)

/* INTERRUPT_ICACHE_PRELOAD_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_ICACHE_PRELOAD_INT_MAP  0x0000001f
#define INTERRUPT_ICACHE_PRELOAD_INT_MAP_M  ((INTERRUPT_ICACHE_PRELOAD_INT_MAP_V) << (INTERRUPT_ICACHE_PRELOAD_INT_MAP_S))
#define INTERRUPT_ICACHE_PRELOAD_INT_MAP_V  0x1f
#define INTERRUPT_ICACHE_PRELOAD_INT_MAP_S  0

#define INTERRUPT_ICACHE_SYNC_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0a8)

/* INTERRUPT_ICACHE_SYNC_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_ICACHE_SYNC_INT_MAP  0x0000001f
#define INTERRUPT_ICACHE_SYNC_INT_MAP_M  ((INTERRUPT_ICACHE_SYNC_INT_MAP_V) << (INTERRUPT_ICACHE_SYNC_INT_MAP_S))
#define INTERRUPT_ICACHE_SYNC_INT_MAP_V  0x1f
#define INTERRUPT_ICACHE_SYNC_INT_MAP_S  0

#define INTERRUPT_APB_ADC_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0ac)

/* INTERRUPT_APB_ADC_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_APB_ADC_INT_MAP  0x0000001f
#define INTERRUPT_APB_ADC_INT_MAP_M  ((INTERRUPT_APB_ADC_INT_MAP_V) << (INTERRUPT_APB_ADC_INT_MAP_S))
#define INTERRUPT_APB_ADC_INT_MAP_V  0x1f
#define INTERRUPT_APB_ADC_INT_MAP_S  0

#define INTERRUPT_DMA_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0b0)

/* INTERRUPT_DMA_CH0_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_DMA_CH0_INT_MAP  0x0000001f
#define INTERRUPT_DMA_CH0_INT_MAP_M  ((INTERRUPT_DMA_CH0_INT_MAP_V) << (INTERRUPT_DMA_CH0_INT_MAP_S))
#define INTERRUPT_DMA_CH0_INT_MAP_V  0x1f
#define INTERRUPT_DMA_CH0_INT_MAP_S  0

#define INTERRUPT_DMA_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0b4)

/* INTERRUPT_DMA_CH1_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_DMA_CH1_INT_MAP  0x0000001f
#define INTERRUPT_DMA_CH1_INT_MAP_M  ((INTERRUPT_DMA_CH1_INT_MAP_V) << (INTERRUPT_DMA_CH1_INT_MAP_S))
#define INTERRUPT_DMA_CH1_INT_MAP_V  0x1f
#define INTERRUPT_DMA_CH1_INT_MAP_S  0

#define INTERRUPT_DMA_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0b8)

/* INTERRUPT_DMA_CH2_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_DMA_CH2_INT_MAP  0x0000001f
#define INTERRUPT_DMA_CH2_INT_MAP_M  ((INTERRUPT_DMA_CH2_INT_MAP_V) << (INTERRUPT_DMA_CH2_INT_MAP_S))
#define INTERRUPT_DMA_CH2_INT_MAP_V  0x1f
#define INTERRUPT_DMA_CH2_INT_MAP_S  0

#define INTERRUPT_RSA_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0bc)

/* INTERRUPT_RSA_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_RSA_INT_MAP  0x0000001f
#define INTERRUPT_RSA_INT_MAP_M  ((INTERRUPT_RSA_INT_MAP_V) << (INTERRUPT_RSA_INT_MAP_S))
#define INTERRUPT_RSA_INT_MAP_V  0x1f
#define INTERRUPT_RSA_INT_MAP_S  0

#define INTERRUPT_AES_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0c0)

/* INTERRUPT_AES_INT_MAP : R/W [4:0] : 5'd0 ; */

