apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_interrupt.h
#define INTERRUPT_AES_INT_MAP  0x0000001f
#define INTERRUPT_AES_INT_MAP_M  ((INTERRUPT_AES_INT_MAP_V) << (INTERRUPT_AES_INT_MAP_S))
#define INTERRUPT_AES_INT_MAP_V  0x1f
#define INTERRUPT_AES_INT_MAP_S  0

#define INTERRUPT_SHA_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0c4)

/* INTERRUPT_SHA_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_SHA_INT_MAP  0x0000001f
#define INTERRUPT_SHA_INT_MAP_M  ((INTERRUPT_SHA_INT_MAP_V) << (INTERRUPT_SHA_INT_MAP_S))
#define INTERRUPT_SHA_INT_MAP_V  0x1f
#define INTERRUPT_SHA_INT_MAP_S  0

#define INTERRUPT_CPU_INTR_FROM_CPU_0_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0c8)

/* INTERRUPT_CPU_INTR_FROM_CPU_0_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CPU_INTR_FROM_CPU_0_MAP  0x0000001f
#define INTERRUPT_CPU_INTR_FROM_CPU_0_MAP_M  ((INTERRUPT_CPU_INTR_FROM_CPU_0_MAP_V) << (INTERRUPT_CPU_INTR_FROM_CPU_0_MAP_S))
#define INTERRUPT_CPU_INTR_FROM_CPU_0_MAP_V  0x1f
#define INTERRUPT_CPU_INTR_FROM_CPU_0_MAP_S  0

#define INTERRUPT_CPU_INTR_FROM_CPU_1_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0cc)

/* INTERRUPT_CPU_INTR_FROM_CPU_1_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CPU_INTR_FROM_CPU_1_MAP  0x0000001f
#define INTERRUPT_CPU_INTR_FROM_CPU_1_MAP_M  ((INTERRUPT_CPU_INTR_FROM_CPU_1_MAP_V) << (INTERRUPT_CPU_INTR_FROM_CPU_1_MAP_S))
#define INTERRUPT_CPU_INTR_FROM_CPU_1_MAP_V  0x1f
#define INTERRUPT_CPU_INTR_FROM_CPU_1_MAP_S  0

#define INTERRUPT_CPU_INTR_FROM_CPU_2_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0d0)

/* INTERRUPT_CPU_INTR_FROM_CPU_2_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CPU_INTR_FROM_CPU_2_MAP  0x0000001f
#define INTERRUPT_CPU_INTR_FROM_CPU_2_MAP_M  ((INTERRUPT_CPU_INTR_FROM_CPU_2_MAP_V) << (INTERRUPT_CPU_INTR_FROM_CPU_2_MAP_S))
#define INTERRUPT_CPU_INTR_FROM_CPU_2_MAP_V  0x1f
#define INTERRUPT_CPU_INTR_FROM_CPU_2_MAP_S  0

#define INTERRUPT_CPU_INTR_FROM_CPU_3_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0d4)

/* INTERRUPT_CPU_INTR_FROM_CPU_3_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CPU_INTR_FROM_CPU_3_MAP  0x0000001f
#define INTERRUPT_CPU_INTR_FROM_CPU_3_MAP_M  ((INTERRUPT_CPU_INTR_FROM_CPU_3_MAP_V) << (INTERRUPT_CPU_INTR_FROM_CPU_3_MAP_S))
#define INTERRUPT_CPU_INTR_FROM_CPU_3_MAP_V  0x1f
#define INTERRUPT_CPU_INTR_FROM_CPU_3_MAP_S  0

#define INTERRUPT_ASSIST_DEBUG_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0d8)

/* INTERRUPT_ASSIST_DEBUG_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_ASSIST_DEBUG_INTR_MAP  0x0000001f
#define INTERRUPT_ASSIST_DEBUG_INTR_MAP_M  ((INTERRUPT_ASSIST_DEBUG_INTR_MAP_V) << (INTERRUPT_ASSIST_DEBUG_INTR_MAP_S))
#define INTERRUPT_ASSIST_DEBUG_INTR_MAP_V  0x1f
#define INTERRUPT_ASSIST_DEBUG_INTR_MAP_S  0

#define INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0dc)

/* INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP  0x0000001f
#define INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_M  ((INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_V) << (INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_S))
#define INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x1f
#define INTERRUPT_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

#define INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0e0)

/* INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP  0x0000001f
#define INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  ((INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V) << (INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S))
#define INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x1f
#define INTERRUPT_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

#define INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0e4)

/* INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP  0x0000001f
#define INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  ((INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V) << (INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S))
#define INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x1f
#define INTERRUPT_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0e8)

/* INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP  0x0000001f
#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_M  ((INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V) << (INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S))
#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x1f
#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0ec)

/* INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP :
 * R/W [4:0] : 5'd0
 */

#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP  0x0000001f
#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_M  ((INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V) << (INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S))
#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V  0x1f
#define INTERRUPT_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S  0

#define INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0f0)

/* INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP  0x0000001f
#define INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP_M  ((INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP_V) << (INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP_S))
#define INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP_V  0x1f
#define INTERRUPT_BACKUP_PMS_VIOLATE_INTR_MAP_S  0

#define INTERRUPT_CACHE_CORE0_ACS_INT_MAP_REG          (DR_REG_INTERRUPT_BASE + 0x0f4)

/* INTERRUPT_CACHE_CORE0_ACS_INT_MAP : R/W [4:0] : 5'd0 ; */

#define INTERRUPT_CACHE_CORE0_ACS_INT_MAP  0x0000001f
#define INTERRUPT_CACHE_CORE0_ACS_INT_MAP_M  ((INTERRUPT_CACHE_CORE0_ACS_INT_MAP_V) << (INTERRUPT_CACHE_CORE0_ACS_INT_MAP_S))
#define INTERRUPT_CACHE_CORE0_ACS_INT_MAP_V  0x1f
#define INTERRUPT_CACHE_CORE0_ACS_INT_MAP_S  0

#define INTERRUPT_INTR_STATUS_0_REG          (DR_REG_INTERRUPT_BASE + 0x0f8)

/* INTERRUPT_INTR_STATUS_0 : RO [31:0] : 32'h0 ; */

#define INTERRUPT_INTR_STATUS_0  0xffffffff
#define INTERRUPT_INTR_STATUS_0_M  ((INTERRUPT_INTR_STATUS_0_V) << (INTERRUPT_INTR_STATUS_0_S))
#define INTERRUPT_INTR_STATUS_0_V  0xffffffff
#define INTERRUPT_INTR_STATUS_0_S  0

#define INTERRUPT_INTR_STATUS_1_REG          (DR_REG_INTERRUPT_BASE + 0x0fc)

