apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_interrupt.h
/* INTERRUPT_INTR_STATUS_1 : RO [31:0] : 32'h0 ; */

#define INTERRUPT_INTR_STATUS_1  0xffffffff
#define INTERRUPT_INTR_STATUS_1_M  ((INTERRUPT_INTR_STATUS_1_V) << (INTERRUPT_INTR_STATUS_1_S))
#define INTERRUPT_INTR_STATUS_1_V  0xffffffff
#define INTERRUPT_INTR_STATUS_1_S  0

#define INTERRUPT_CLOCK_GATE_REG          (DR_REG_INTERRUPT_BASE + 0x100)

/* INTERRUPT_CLK_EN : R/W [0] : 1'b1 ; */

#define INTERRUPT_CLK_EN  (BIT(0))
#define INTERRUPT_CLK_EN_M  (BIT(0))
#define INTERRUPT_CLK_EN_V  0x1
#define INTERRUPT_CLK_EN_S  0

#define INTERRUPT_CPU_INT_ENABLE_REG          (DR_REG_INTERRUPT_BASE + 0x104)

/* INTERRUPT_CPU_INT_ENABLE : R/W [31:0] : 32'b0 ; */

#define INTERRUPT_CPU_INT_ENABLE  0xffffffff
#define INTERRUPT_CPU_INT_ENABLE_M  ((INTERRUPT_CPU_INT_ENABLE_V) << (INTERRUPT_CPU_INT_ENABLE_S))
#define INTERRUPT_CPU_INT_ENABLE_V  0xffffffff
#define INTERRUPT_CPU_INT_ENABLE_S  0

#define INTERRUPT_CPU_INT_TYPE_REG          (DR_REG_INTERRUPT_BASE + 0x108)

/* INTERRUPT_CPU_INT_TYPE : R/W [31:0] : 32'b0 ; */

#define INTERRUPT_CPU_INT_TYPE  0xffffffff
#define INTERRUPT_CPU_INT_TYPE_M  ((INTERRUPT_CPU_INT_TYPE_V) << (INTERRUPT_CPU_INT_TYPE_S))
#define INTERRUPT_CPU_INT_TYPE_V  0xffffffff
#define INTERRUPT_CPU_INT_TYPE_S  0

#define INTERRUPT_CPU_INT_CLEAR_REG          (DR_REG_INTERRUPT_BASE + 0x10c)

/* INTERRUPT_CPU_INT_CLEAR : R/W [31:0] : 32'b0 ; */

#define INTERRUPT_CPU_INT_CLEAR  0xffffffff
#define INTERRUPT_CPU_INT_CLEAR_M  ((INTERRUPT_CPU_INT_CLEAR_V) << (INTERRUPT_CPU_INT_CLEAR_S))
#define INTERRUPT_CPU_INT_CLEAR_V  0xffffffff
#define INTERRUPT_CPU_INT_CLEAR_S  0

#define INTERRUPT_CPU_INT_EIP_STATUS_REG          (DR_REG_INTERRUPT_BASE + 0x110)

/* INTERRUPT_CPU_INT_EIP_STATUS : RO [31:0] : 32'b0 ; */

#define INTERRUPT_CPU_INT_EIP_STATUS  0xffffffff
#define INTERRUPT_CPU_INT_EIP_STATUS_M  ((INTERRUPT_CPU_INT_EIP_STATUS_V) << (INTERRUPT_CPU_INT_EIP_STATUS_S))
#define INTERRUPT_CPU_INT_EIP_STATUS_V  0xffffffff
#define INTERRUPT_CPU_INT_EIP_STATUS_S  0

#define INTERRUPT_CPU_INT_PRI_0_REG          (DR_REG_INTERRUPT_BASE + 0x114)

/* INTERRUPT_CPU_PRI_0_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_0_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_0_MAP_M  ((INTERRUPT_CPU_PRI_0_MAP_V) << (INTERRUPT_CPU_PRI_0_MAP_S))
#define INTERRUPT_CPU_PRI_0_MAP_V  0xf
#define INTERRUPT_CPU_PRI_0_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_1_REG          (DR_REG_INTERRUPT_BASE + 0x118)

/* INTERRUPT_CPU_PRI_1_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_1_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_1_MAP_M  ((INTERRUPT_CPU_PRI_1_MAP_V) << (INTERRUPT_CPU_PRI_1_MAP_S))
#define INTERRUPT_CPU_PRI_1_MAP_V  0xf
#define INTERRUPT_CPU_PRI_1_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_2_REG          (DR_REG_INTERRUPT_BASE + 0x11c)

/* INTERRUPT_CPU_PRI_2_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_2_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_2_MAP_M  ((INTERRUPT_CPU_PRI_2_MAP_V) << (INTERRUPT_CPU_PRI_2_MAP_S))
#define INTERRUPT_CPU_PRI_2_MAP_V  0xf
#define INTERRUPT_CPU_PRI_2_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_3_REG          (DR_REG_INTERRUPT_BASE + 0x120)

/* INTERRUPT_CPU_PRI_3_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_3_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_3_MAP_M  ((INTERRUPT_CPU_PRI_3_MAP_V) << (INTERRUPT_CPU_PRI_3_MAP_S))
#define INTERRUPT_CPU_PRI_3_MAP_V  0xf
#define INTERRUPT_CPU_PRI_3_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_4_REG          (DR_REG_INTERRUPT_BASE + 0x124)

/* INTERRUPT_CPU_PRI_4_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_4_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_4_MAP_M  ((INTERRUPT_CPU_PRI_4_MAP_V) << (INTERRUPT_CPU_PRI_4_MAP_S))
#define INTERRUPT_CPU_PRI_4_MAP_V  0xf
#define INTERRUPT_CPU_PRI_4_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_5_REG          (DR_REG_INTERRUPT_BASE + 0x128)

/* INTERRUPT_CPU_PRI_5_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_5_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_5_MAP_M  ((INTERRUPT_CPU_PRI_5_MAP_V) << (INTERRUPT_CPU_PRI_5_MAP_S))
#define INTERRUPT_CPU_PRI_5_MAP_V  0xf
#define INTERRUPT_CPU_PRI_5_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_6_REG          (DR_REG_INTERRUPT_BASE + 0x12c)

/* INTERRUPT_CPU_PRI_6_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_6_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_6_MAP_M  ((INTERRUPT_CPU_PRI_6_MAP_V) << (INTERRUPT_CPU_PRI_6_MAP_S))
#define INTERRUPT_CPU_PRI_6_MAP_V  0xf
#define INTERRUPT_CPU_PRI_6_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_7_REG          (DR_REG_INTERRUPT_BASE + 0x130)

/* INTERRUPT_CPU_PRI_7_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_7_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_7_MAP_M  ((INTERRUPT_CPU_PRI_7_MAP_V) << (INTERRUPT_CPU_PRI_7_MAP_S))
#define INTERRUPT_CPU_PRI_7_MAP_V  0xf
#define INTERRUPT_CPU_PRI_7_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_8_REG          (DR_REG_INTERRUPT_BASE + 0x134)

/* INTERRUPT_CPU_PRI_8_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_8_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_8_MAP_M  ((INTERRUPT_CPU_PRI_8_MAP_V) << (INTERRUPT_CPU_PRI_8_MAP_S))
#define INTERRUPT_CPU_PRI_8_MAP_V  0xf
#define INTERRUPT_CPU_PRI_8_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_9_REG          (DR_REG_INTERRUPT_BASE + 0x138)

/* INTERRUPT_CPU_PRI_9_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_9_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_9_MAP_M  ((INTERRUPT_CPU_PRI_9_MAP_V) << (INTERRUPT_CPU_PRI_9_MAP_S))
#define INTERRUPT_CPU_PRI_9_MAP_V  0xf
#define INTERRUPT_CPU_PRI_9_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_10_REG          (DR_REG_INTERRUPT_BASE + 0x13c)

/* INTERRUPT_CPU_PRI_10_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_10_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_10_MAP_M  ((INTERRUPT_CPU_PRI_10_MAP_V) << (INTERRUPT_CPU_PRI_10_MAP_S))
#define INTERRUPT_CPU_PRI_10_MAP_V  0xf
#define INTERRUPT_CPU_PRI_10_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_11_REG          (DR_REG_INTERRUPT_BASE + 0x140)

/* INTERRUPT_CPU_PRI_11_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_11_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_11_MAP_M  ((INTERRUPT_CPU_PRI_11_MAP_V) << (INTERRUPT_CPU_PRI_11_MAP_S))
#define INTERRUPT_CPU_PRI_11_MAP_V  0xf
#define INTERRUPT_CPU_PRI_11_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_12_REG          (DR_REG_INTERRUPT_BASE + 0x144)

