apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_interrupt.h
/* INTERRUPT_CPU_PRI_12_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_12_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_12_MAP_M  ((INTERRUPT_CPU_PRI_12_MAP_V) << (INTERRUPT_CPU_PRI_12_MAP_S))
#define INTERRUPT_CPU_PRI_12_MAP_V  0xf
#define INTERRUPT_CPU_PRI_12_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_13_REG          (DR_REG_INTERRUPT_BASE + 0x148)

/* INTERRUPT_CPU_PRI_13_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_13_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_13_MAP_M  ((INTERRUPT_CPU_PRI_13_MAP_V) << (INTERRUPT_CPU_PRI_13_MAP_S))
#define INTERRUPT_CPU_PRI_13_MAP_V  0xf
#define INTERRUPT_CPU_PRI_13_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_14_REG          (DR_REG_INTERRUPT_BASE + 0x14c)

/* INTERRUPT_CPU_PRI_14_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_14_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_14_MAP_M  ((INTERRUPT_CPU_PRI_14_MAP_V) << (INTERRUPT_CPU_PRI_14_MAP_S))
#define INTERRUPT_CPU_PRI_14_MAP_V  0xf
#define INTERRUPT_CPU_PRI_14_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_15_REG          (DR_REG_INTERRUPT_BASE + 0x150)

/* INTERRUPT_CPU_PRI_15_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_15_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_15_MAP_M  ((INTERRUPT_CPU_PRI_15_MAP_V) << (INTERRUPT_CPU_PRI_15_MAP_S))
#define INTERRUPT_CPU_PRI_15_MAP_V  0xf
#define INTERRUPT_CPU_PRI_15_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_16_REG          (DR_REG_INTERRUPT_BASE + 0x154)

/* INTERRUPT_CPU_PRI_16_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_16_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_16_MAP_M  ((INTERRUPT_CPU_PRI_16_MAP_V) << (INTERRUPT_CPU_PRI_16_MAP_S))
#define INTERRUPT_CPU_PRI_16_MAP_V  0xf
#define INTERRUPT_CPU_PRI_16_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_17_REG          (DR_REG_INTERRUPT_BASE + 0x158)

/* INTERRUPT_CPU_PRI_17_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_17_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_17_MAP_M  ((INTERRUPT_CPU_PRI_17_MAP_V) << (INTERRUPT_CPU_PRI_17_MAP_S))
#define INTERRUPT_CPU_PRI_17_MAP_V  0xf
#define INTERRUPT_CPU_PRI_17_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_18_REG          (DR_REG_INTERRUPT_BASE + 0x15c)

/* INTERRUPT_CPU_PRI_18_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_18_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_18_MAP_M  ((INTERRUPT_CPU_PRI_18_MAP_V) << (INTERRUPT_CPU_PRI_18_MAP_S))
#define INTERRUPT_CPU_PRI_18_MAP_V  0xf
#define INTERRUPT_CPU_PRI_18_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_19_REG          (DR_REG_INTERRUPT_BASE + 0x160)

/* INTERRUPT_CPU_PRI_19_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_19_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_19_MAP_M  ((INTERRUPT_CPU_PRI_19_MAP_V) << (INTERRUPT_CPU_PRI_19_MAP_S))
#define INTERRUPT_CPU_PRI_19_MAP_V  0xf
#define INTERRUPT_CPU_PRI_19_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_20_REG          (DR_REG_INTERRUPT_BASE + 0x164)

/* INTERRUPT_CPU_PRI_20_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_20_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_20_MAP_M  ((INTERRUPT_CPU_PRI_20_MAP_V) << (INTERRUPT_CPU_PRI_20_MAP_S))
#define INTERRUPT_CPU_PRI_20_MAP_V  0xf
#define INTERRUPT_CPU_PRI_20_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_21_REG          (DR_REG_INTERRUPT_BASE + 0x168)

/* INTERRUPT_CPU_PRI_21_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_21_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_21_MAP_M  ((INTERRUPT_CPU_PRI_21_MAP_V) << (INTERRUPT_CPU_PRI_21_MAP_S))
#define INTERRUPT_CPU_PRI_21_MAP_V  0xf
#define INTERRUPT_CPU_PRI_21_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_22_REG          (DR_REG_INTERRUPT_BASE + 0x16c)

/* INTERRUPT_CPU_PRI_22_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_22_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_22_MAP_M  ((INTERRUPT_CPU_PRI_22_MAP_V) << (INTERRUPT_CPU_PRI_22_MAP_S))
#define INTERRUPT_CPU_PRI_22_MAP_V  0xf
#define INTERRUPT_CPU_PRI_22_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_23_REG          (DR_REG_INTERRUPT_BASE + 0x170)

/* INTERRUPT_CPU_PRI_23_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_23_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_23_MAP_M  ((INTERRUPT_CPU_PRI_23_MAP_V) << (INTERRUPT_CPU_PRI_23_MAP_S))
#define INTERRUPT_CPU_PRI_23_MAP_V  0xf
#define INTERRUPT_CPU_PRI_23_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_24_REG          (DR_REG_INTERRUPT_BASE + 0x174)

/* INTERRUPT_CPU_PRI_24_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_24_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_24_MAP_M  ((INTERRUPT_CPU_PRI_24_MAP_V) << (INTERRUPT_CPU_PRI_24_MAP_S))
#define INTERRUPT_CPU_PRI_24_MAP_V  0xf
#define INTERRUPT_CPU_PRI_24_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_25_REG          (DR_REG_INTERRUPT_BASE + 0x178)

/* INTERRUPT_CPU_PRI_25_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_25_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_25_MAP_M  ((INTERRUPT_CPU_PRI_25_MAP_V) << (INTERRUPT_CPU_PRI_25_MAP_S))
#define INTERRUPT_CPU_PRI_25_MAP_V  0xf
#define INTERRUPT_CPU_PRI_25_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_26_REG          (DR_REG_INTERRUPT_BASE + 0x17c)

/* INTERRUPT_CPU_PRI_26_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_26_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_26_MAP_M  ((INTERRUPT_CPU_PRI_26_MAP_V) << (INTERRUPT_CPU_PRI_26_MAP_S))
#define INTERRUPT_CPU_PRI_26_MAP_V  0xf
#define INTERRUPT_CPU_PRI_26_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_27_REG          (DR_REG_INTERRUPT_BASE + 0x180)

/* INTERRUPT_CPU_PRI_27_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_27_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_27_MAP_M  ((INTERRUPT_CPU_PRI_27_MAP_V) << (INTERRUPT_CPU_PRI_27_MAP_S))
#define INTERRUPT_CPU_PRI_27_MAP_V  0xf
#define INTERRUPT_CPU_PRI_27_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_28_REG          (DR_REG_INTERRUPT_BASE + 0x184)

/* INTERRUPT_CPU_PRI_28_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_28_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_28_MAP_M  ((INTERRUPT_CPU_PRI_28_MAP_V) << (INTERRUPT_CPU_PRI_28_MAP_S))
#define INTERRUPT_CPU_PRI_28_MAP_V  0xf
#define INTERRUPT_CPU_PRI_28_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_29_REG          (DR_REG_INTERRUPT_BASE + 0x188)

/* INTERRUPT_CPU_PRI_29_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_29_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_29_MAP_M  ((INTERRUPT_CPU_PRI_29_MAP_V) << (INTERRUPT_CPU_PRI_29_MAP_S))
#define INTERRUPT_CPU_PRI_29_MAP_V  0xf
#define INTERRUPT_CPU_PRI_29_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_30_REG          (DR_REG_INTERRUPT_BASE + 0x18c)

