apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_interrupt.h
/* INTERRUPT_CPU_PRI_30_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_30_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_30_MAP_M  ((INTERRUPT_CPU_PRI_30_MAP_V) << (INTERRUPT_CPU_PRI_30_MAP_S))
#define INTERRUPT_CPU_PRI_30_MAP_V  0xf
#define INTERRUPT_CPU_PRI_30_MAP_S  0

#define INTERRUPT_CPU_INT_PRI_31_REG          (DR_REG_INTERRUPT_BASE + 0x190)

/* INTERRUPT_CPU_PRI_31_MAP : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_PRI_31_MAP  0x0000000f
#define INTERRUPT_CPU_PRI_31_MAP_M  ((INTERRUPT_CPU_PRI_31_MAP_V) << (INTERRUPT_CPU_PRI_31_MAP_S))
#define INTERRUPT_CPU_PRI_31_MAP_V  0xf
#define INTERRUPT_CPU_PRI_31_MAP_S  0
#define INTC_INT_PRIO_REG(n)                        (INTERRUPT_CPU_INT_PRI_0_REG + (n)*4)

#define INTERRUPT_CPU_INT_THRESH_REG          (DR_REG_INTERRUPT_BASE + 0x194)

/* INTERRUPT_CPU_INT_THRESH : R/W [3:0] : 4'b0 ; */

#define INTERRUPT_CPU_INT_THRESH  0x0000000f
#define INTERRUPT_CPU_INT_THRESH_M  ((INTERRUPT_CPU_INT_THRESH_V) << (INTERRUPT_CPU_INT_THRESH_S))
#define INTERRUPT_CPU_INT_THRESH_V  0xf
#define INTERRUPT_CPU_INT_THRESH_S  0

#define INTERRUPT_INTERRUPT_DATE_REG          (DR_REG_INTERRUPT_BASE + 0x7fc)

/* INTERRUPT_INTERRUPT_DATE : R/W [27:0] : 28'h2007210 ; */

#define INTERRUPT_INTERRUPT_DATE  0x0fffffff
#define INTERRUPT_INTERRUPT_DATE_M  ((INTERRUPT_INTERRUPT_DATE_V) << (INTERRUPT_INTERRUPT_DATE_S))
#define INTERRUPT_INTERRUPT_DATE_V  0xfffffff
#define INTERRUPT_INTERRUPT_DATE_S  0

#endif /* __ARCH_RISCV_SRC_ESP32C3_HARDWARE_ESP32C3_INTERRUPT_H */
